[
    {
        "title":"Dan Dan Mian \\n(Spicy Ground Pork Noodles)",
        "image":"dandan.jpg",
        "time":30,
        "level":"Intermediate",
        "serving":4,
        "description":"Italians learned how to make pasta from the Chinese! So, long before there was Bolognese, there was Dan Dan Mian! The savory ground pork bathes the wheat noodles and pairs perfectly with the light spinach.",
        "ingredients":[
            "Thinly Sliced Ginger (2 tbsp):000210",
            "Sweet Soy Sauce (1/4 cup):000171",
            "Light Soy Sauce (1/4 cup):000221",
            "Sambal Chili Sauce (1-2 tbsp):000488",
            "Black Vinegar (2 tsp):000881",
            "Sichuan Peppercorn Powder (1/2 tsp):000523",
            "Chinese Dried Noodle (8 oz):000215",
            "Vegetable Oil (2 tbsp):000875",
            "Chopped Garlic (2 tbsp):000014",
            "Baby Spinach (1 cup):000526",
            "Ground Pork (1 lb):000237",
            "Rice Vinegar (3 tbsp):000852",
            "Thinly Sliced Scallions green parts only (3):000495"],

        "instructions":[
            "Combine the sauce ingredients in a small bowl and reserve.",
            "Boil 3 quarts (2.8L) of water in a 6-quart (5.7L) pot. Cook the noodles for about 10 minutes or until al dente, rinse and drain well in a colander. Place the noodles in a large serving bowl.",
            "Heat the vegetable oil in a wok over high heat. When you see wisps of white smoke, add the garlic, preserved vegetable and baby spinach to the wok and stir-fry for 30 seconds. Add the pork, breaking it up and tossing for 2-3 mintues, or until almost cooked through. Deglaze the pan with sherry and add the reserved sauce. Stir-fry, folding constantly, for 1 more minute or until pork is fully cooked.",
            "Pour the meat sauce over the noodles and top with scallions."
        ]
    },
    {
        "title":"Pad Krapow (Spicy Basil Pork)",
        "image":"padkrapow.jpg",
        "time":20,
        "level":"Easy",
        "serving":4,
        "description":"Pad Krapow is one of the most popular street food dishes in Thailand. It’s also a technique, kind of like calling something an omelet. An omelet is always egg-based, but you can change the fillings. The base of this dish is always Thai basil, garlic, chilies, bell peppers and onions, but you can switch out the proteins as desired.",
        "ingredients":[
            "Sweet Soy Sauce (3 tbsp):000171",
            "Oyster Sauce (2 tbsp):000016",
            "Fish Sauce (4 tbsp):000955",
            "Chili Paste in Soybean Oil (2 tbsp):000289",
            "Vegetable Oil (3 tbsp):000875",
            "Minced Garlic (3 cloves):000209",
            "Sliced Hot Pepper (3-5 small):000517",
            "Lean Ground Pork (3 cups):000237",
            "Medium Sliced Onion (1):000421",
            "Small Sliced Green Bell Pepper (1):000224",
            "Thai Basil Leaves (1.5 cups):000358"
        ],
        "instructions":[
            "Combine the sweet soy sauce, oyster sauce, fish sauce and chili paste in a small bowl and reserve.",
            "Heat your wok or large skillet over high heat and add the vegetable oil. When wisps of white smoke appear, add the garlic and chilies. Cook them until the garlic starts to brown, about 30 seconds.",
            "Stir in the ground pork, flatten against the pan and cook undisturbed for about 45 seconds. The pork will start to brown",
            " turn over once, press flat against the pan and cook for another 30 seconds. Break up the meat into gravel-sized pieces and drain any excess liquid.",
            "Stir in the onion and bell pepper and stir-fry for about a minute. Add the reserved sauce to the wok and combine the ingredients thoroughly for about 1 minute. Add the Thai basil and cook until the pork is thoroughly cooked and onions are slightly tender. Finish with white pepper."
        ]
        }
    ]